In [2]:
import pandas as pd
import scipy.stats as ss

%reload_ext lab_black

# to convert jupyter notebook to html for easier reading elsewhere, use the following in the terminal:
# jupyter nbconvert --to html notebook.ipynb

In [3]:
df = pd.read_csv("WalrusSummary.csv")
df

    WalrusType  Gambell  LittleDiomede  Wales  Nome
0         Male     1178           1001    264   318
1       Female     1508           1352    229   591
2  Unknown Sex      222            133     77   116
3         Calf     1136            117     15    19

In [4]:
df.iloc[0, 1]

1178

In [5]:
walrus_data = {}


places = ["Gambell", "Little Diomede", "Wales", "Nome"]

for row in range(0, 4):
    for col in range(1, 5):
        for i in range(1, df.iloc[row, col] + 1):
            walrus_data.setdefault("Location", []).append(places[col - 1])
            walrus_data.setdefault("WalrusType", []).append(df.iloc[row, 0])


walrus_data_df = pd.DataFrame(walrus_data)
walrus_data_df

     Location WalrusType
0     Gambell       Male
1     Gambell       Male
2     Gambell       Male
3     Gambell       Male
4     Gambell       Male
...       ...        ...
8271     Nome       Calf
8272     Nome       Calf
8273     Nome       Calf
8274     Nome       Calf
8275     Nome       Calf

[8276 rows x 2 columns]

In [6]:
walrus_data_df.to_csv("walrus_obs_data.csv", index=False)

In [25]:
walrus_data_df["WalrusType"].value_counts()

Female         3680
Male           2761
Calf           1287
Unknown Sex     548
Name: WalrusType, dtype: int64

In [28]:
walrus_data_df["Location"].value_counts()

Gambell           4044
Little Diomede    2603
Nome              1044
Wales              585
Name: Location, dtype: int64

In [34]:
contingency_table_observed = pd.crosstab(
    walrus_data_df["WalrusType"], walrus_data_df["Location"], margins=False
)
contingency_table_observed

Location     Gambell  Little Diomede  Nome  Wales
WalrusType
Calf            1136             117    19     15
Female          1508            1352   591    229
Male            1178            1001   318    264
Unknown Sex      222             133   116     77

In [43]:
chi_sq = ss.chi2_contingency(contingency_table_observed)[0]
p_val = ss.chi2_contingency(contingency_table_observed)[1]


print("Contingency table for walrus data is: ")
print(contingency_table_observed)
print("=" * 20)
print(f"Chi-square test statistic is: {chi_sq:.2f}")
print(f"p-value of the test is: {p_val:2e}")

Contingency table for walrus data is:
Location     Gambell  Little Diomede  Nome  Wales
WalrusType
Calf            1136             117    19     15
Female          1508            1352   591    229
Male            1178            1001   318    264
Unknown Sex      222             133   116     77
====================
Chi-square test statistic is: 1076.70
p-value of the test is: 4.929343e-226